---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenAreaLoadLoop
source: html/acd141fc-73fe-b87a-05cc-905d09c1e473.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenAreaLoadLoop Property

Area Load Sketch can't contain open loops.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenAreaLoadLoop { get; }
```